Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisModifierEnum
The axis modifiers.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisModifierEnum.AXIS_MODIFIER_NONE
The axis modifier is "none".

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisModifierEnum.AXIS_MODIFIER_FIXED_COORDINATE
The axis modifier is "fixed coordinate".

Tekla.Structures.Analysis.AnalysisPartPositionProperties.AxisModifierEnum.AXIS_MODIFIER_NEAREST_GRID
The axis modifier is "nearest grid".